# 2. Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# Простые делители числа

# in
# 54

# out
# [2, 3, 3, 3]

n = 60

a = 2
size = []
while a * a <= n:
    while n % a == 0:
        size.append(a)
        n = n / a
    a = a + 1
if n > 1:
       size.append(n)
print(size)
