# 3. Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности в том же порядке.
# in
# 7

# out
# [4, 5, 3, 3, 4, 1, 2]
# [5, 1, 2]

# in
# -1

# out
# Negative value of the number of numbers!
# []

# in
# 10

# out
# [4, 4, 5, 5, 6, 2, 3, 0, 9, 4]
# [6, 2, 3, 0, 9]

a = [4, 5, 3, 3, 4, 1, 2]
print(f'Список чисел - {a}')
f = 0
b = len(a)
x = 0
while f < b:
    x = f + 1 
    de = 0
    while x < b:
        if a[f] == a[x]:
            del a[x]
            b = b - 1
            de = 1
        elif a[f] != a[x]:
            x = x + 1
    if de > 0:
        del a[f]
        b = b - 1
    elif de == 0:
        f = f + 1  
print(f'Не повторяющиеся числа в списке - {a}')


    





